INSERT INTO product_type(name)
VALUES ('Груша'),
       ('Яблоко');

INSERT INTO product_category(name)
VALUES ('Новый урожай'),
       ('Конференция'),
       ('Скороспелка'),
       ('Алматинский Апорт');

INSERT INTO product(type_id, category_id, description)
VALUES (1, 1, 'топ 100 товаров'),
       (1, 2, 'с гнильцой'),
       (2, 3, 'фасованные'),
       (2, 4, 'есть червивые');

INSERT INTO supplier(name, address, inn)
VALUES ('Поставщик №1', 'Москва', 123456789221),
       ('Поставщик №2', 'Волгоград', 123456789222),
       ('Поставщик №3', 'Ставрополь', 123456789223);

INSERT INTO product_price(supplier_id, product_id, period_start, period_end, price, weight_measure)
VALUES (1, 1, '2022-01-01', '2022-12-31', 50, 'KG'),
       (1, 2, '2022-01-01', '2022-12-31', 60, 'KG'),
       (1, 3, '2022-01-01', '2022-12-31', 70, 'KG'),
       (1, 4, '2022-01-01', '2022-12-31', 80, 'KG'),
       (2, 1, '2022-01-01', '2022-12-31', 90, 'KG'),
       (2, 2, '2022-01-01', '2022-12-31', 100, 'KG'),
       (2, 3, '2022-01-01', '2022-12-31', 111, 'KG'),
       (2, 4, '2022-01-01', '2022-12-31', 121, 'KG'),
       (3, 1, '2022-01-01', '2022-12-31', 144, 'KG'),
       (3, 2, '2022-01-01', '2022-12-31', 169, 'KG'),
       (3, 3, '2022-01-01', '2022-12-31', 196, 'KG'),
       (3, 4, '2022-01-01', '2022-12-31', 225, 'KG');